Tekla Open API Reference for Tekla Structures 2025
Drawing.CommitChanges Method (String)
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CommitChanges(
	string Message
)
Public Function CommitChanges (
	Message As String
) As Boolean
Parameters
Message
Type: System.String
The message to be saved with the commit.
Return Value
Type: Boolean
True on success.
See Also
Reference
Drawing Class
CommitChanges Overload
Tekla.Structures.Drawing Namespace